# there are 2 datatype in Pandas Series and dataframe

1. pd.series('collection datatype')
   - ser1 = pd.series([10,20,30])
   - 0 10
   - 0 20
   - 0 30

```python
di = {
    'Name': ['Riyan', 'Amaan', 'Adnan'],
    'age': [20, 22, 23],
    'Course':['Ds', 'DevOP', 'Bussiness']
}
```

In [32]:
import pandas as pd
import numpy as np

pd.__version__

'2.3.1'

In [31]:
np.__version__

'2.3.2'

In [4]:
series1 = pd.Series([10,20,30,40,50])

print(series1.size)
print(series1.ndim)
print(series1)

type(series1)

5
1
0    10
1    20
2    30
3    40
4    50
dtype: int64

pandas.core.series.Series

In [5]:
tup = ("Riyan","Amaan","Adnan")

s = pd.Series(tup)

s

0    Riyan
1    Amaan
2    Adnan
dtype: object

In [6]:
di = {101:"Riyan",102:"Amaan",103:"Adnan"}

s = pd.Series(di)

s

101    Riyan
102    Amaan
103    Adnan
dtype: object

**WAP to create a dataFrame where colums are emp_id, name, role, salary**

In [18]:
di = {
     'emp_id':[1001, 1002, 1003],
    'Name': ['Riyan', 'Amaan', 'Adnan'],
    'role':['Data Scientist', 'DevOP', 'Webdev'],
    'salary': [20000, 22000, 23000]
}

In [19]:
df = pd.DataFrame(di)

In [17]:
df

   emp_id   Name    role  salary
0    1001  Riyan      Ds   20000
1    1002  Amaan   DevOP   22000
2    1003  Adnan  Webdev   23000

In [20]:
df.ndim

2

In [21]:
df.size

12

In [22]:
df.shape

(3, 4)

In [26]:
df1 = pd.DataFrame(
    {
    'Name': ['Riyan', 'Amaan', 'Adnan'],
    'age': [20, 22, 23],
    'Course':['Ds', 'DevOP', 'Bussiness']
}
)

In [27]:
df1

    Name  age     Course
0  Riyan   20         Ds
1  Amaan   22      DevOP
2  Adnan   23  Bussiness

**WAP to create a datafrmae using dict of array, where keys are name course and score**

In [39]:
name = np.array(['Riyan','Amaan','Adnan'])
course = np.array(['DS','DevOps','WebDev'])
score = np.array([44,46,78])

di = {'Name':name, 'Crouse':course, 'Scrose':score}

In [33]:
arr_dict = np.array({
    'name':['Riyan','Amaan','Adnan'],
    'course':['DS','DevOps','WebDev'],
    'score':[90, 80 , 60],
}
                   )

In [34]:
arr_dict

array({'name': ['Riyan', 'Amaan', 'Adnan'], 'course': ['DS', 'DevOps', 'WebDev'], 'score': [90, 80, 60]},
      dtype=object)

In [41]:
df2 = pd.DataFrame(di)
df2

    Name  Crouse  Scrose
0  Riyan      DS      44
1  Amaan  DevOps      46
2  Adnan  WebDev      78

****

In [43]:
name = pd.Series(['Riyan','Amaan','Adnan'])
course = pd.Series(['DS','DevOps','WebDev'])
score = pd.Series([44,46,78])

di = {'Name':name, 'Crouse':course, 'Scrose':score} # dict of collectiom
print(type(di))

df3 = pd.DataFrame(di)
df3

<class 'dict'>

    Name  Crouse  Scrose
0  Riyan      DS      44
1  Amaan  DevOps      46
2  Adnan  WebDev      78

In [45]:
# dict of collectiom
di = {
    'name':pd.Series(['Riyan','Amaan','Adnan']),
    'course':pd.Series(['DS','DevOps','WebDev']),
    'score':pd.Series([44,46,78])
}
 
df4 = pd.DataFrame(di)

df4

    name  course  score
0  Riyan      DS     44
1  Amaan  DevOps     46
2  Adnan  WebDev     78

# DataFrame:

dict

**WAP to Create a DataFrame of Arrayes where keys are: rollno, age, score**

In [58]:
rollno = np.array(range(1,10,3))
age = np.random.randint(18, 40, 3)
score = np.array([44,46,78])

di = {'RollNo':rollno, 'Age':age, 'Scrose':score}

df5 = pd.DataFrame(di)

df5

   RollNo  Age  Scrose
0       1   29      44
1       4   19      46
2       7   39      78

**WAP to Create a dataframe for Osmania which has the following departments and there values respectively**

1. Eng: Enr_ID, Student_Name, Location
2. Arts: Enr_ID, Student_Name, Location
3. Medical: Enr_ID, Student_Name, Location

In [62]:
Osmania = {'Eng':
           {
               'Enr_ID':[1,2,3],
           'Student_Name':[1,2,3],
            'Location':[1,2,3]
           }, 
           {'Arts':
            {
            'Enr_ID':[1,2,3],
           'Student_Name':[1,2,3],
            'Location':[1,2,3]
            }, 
            {'Medical':
             {'Enr_ID':[1,2,3],
           'Student_Name':[1,2,3],
            'Location':[1,2,3]
             }
            }
           }
          }
df6 = pd.DataFrame(Osmania)

df6

SyntaxError: ':' expected after dictionary key (2968834165.py, line 14)

In [65]:
Osmania = {
    'Eng':{
        'Enr_ID':[101,102,103],
        'Student_Name':['Amaan','Adnan','Riyan'],
        'Location':['TGS', "AP", 'TS']
          },
    'Arts':{
        'Enr_ID':[201,202,203],
        'Student_Name':['faizaan', 'Shahid', 'Qhari'],
        'Location':['TS','Goa','TGS']
          },
    'Medical':{
        'Enr_ID':[301,302,303],
        'Student_Name':["Imaraan", 'Ghouse', 'ligma'],
        'Location':['Ap','TS','TGS']
          },
}

type(Osmania)

dict

In [67]:
Osmania['Eng']

{'Enr_ID': [101, 102, 103],
 'Student_Name': ['Amaan', 'Adnan', 'Riyan'],
 'Location': ['TGS', 'AP', 'TS']}

In [71]:
df7 = pd.DataFrame(Osmania)

df7

,Eng,Arts,Medical
Enr_ID,"[101, 102, 103]","[201, 202, 203]","[301, 302, 303]"
Student_Name,"[Amaan, Adnan, Riyan]","[faizaan, Shahid, Qhari]","[Imaraan, Ghouse, ligma]"
Location,"[TGS, AP, TS]","[TS, Goa, TGS]","[Ap, TS, TGS]"

In [78]:
df7 = pd.DataFrame(Osmania['Eng'])

df8 = pd.DataFrame(Osmania['Arts'])

df9 = pd.DataFrame(Osmania['Medical'])

df7

   Enr_ID Student_Name Location
0     101        Amaan      TGS
1     102        Adnan       AP
2     103        Riyan       TS

In [79]:
df8

   Enr_ID Student_Name Location
0     201      faizaan       TS
1     202       Shahid      Goa
2     203        Qhari      TGS

In [80]:
df9

   Enr_ID Student_Name Location
0     301      Imaraan       Ap
1     302       Ghouse       TS
2     303        ligma      TGS

# Reading files using Pandas

1. File and notebook in same Location:
   - df = pd,read_csv('FileName')
2. File and notebook in diffrent location:
   - df = pd.read_csv("path//to//FileName")

In [118]:
df = pd.DataFrame('CA_county_high_earners.csv'),  index='GEOID'

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (1524517483.py, line 1)

In [90]:
df

    GEOID  high_earners
0    6001        145696
1    6003            30
2    6005          1220
3    6007          6860
4    6009          2046
5    6011           673
6    6013        100758
7    6015           464
8    6017         13490
9    6019         27004
10   6021           465
11   6023          3101
12   6025          3073
13   6027           517
14   6029         23553
15   6031          2943
16   6033          1292
17   6035           794
18   6037        501413
19   6039          2934
20   6041         36709
21   6043           435
22   6045          2317
23   6047          5933
24   6049            87
25   6051           376
26   6053         17144
27   6055         10577
28   6057          5177
29   6059        233459
30   6061         28334
31   6063           642
32   6065         84359
33   6067         65768
34   6069          3088
35   6071         62380
36   6073        194676
37   6075        114989
38   6077         24530
39   6079         15110
40   6081         90392
41   6083         25231
42   6085        221273
43   6087         19628
44   6089          5559
45   6091           111
46   6093           900
47   6095         23192
48   6097         32713
49   6099         14864
50   6101          2720
51   6103          1394
52   6105           261
53   6107          9056
54   6109          2059
55   6111         57121
56   6113         11669
57   6115          1673

In [103]:
df = pd.read_csv('//home//riyan//Desktop//SDHub-DS//SDHub-DS//01_Foundation//03 Python For Data Science//dataset.csv')
df

,College_ID,IQ,Prev_Sem_Result,CGPA,Academic_Performance,Internship_Experience,Extra_Curricular_Score,Communication_Skills,Projects_Completed,Placement
0,CLG0030,107,6.61,6.28,8,No,8,8,4,No
1,CLG0061,97,5.52,5.37,8,No,7,8,0,No
2,CLG0036,109,5.36,5.83,9,No,3,1,1,No
3,CLG0055,122,5.47,5.75,6,Yes,1,6,1,No
4,CLG0004,96,7.91,7.69,7,No,8,10,2,No
...,...,...,...,...,...,...,...,...,...,...
9995,CLG0021,119,8.41,8.29,4,No,1,8,0,Yes
9996,CLG0098,70,9.25,9.34,7,No,0,7,2,No
9997,CLG0066,89,6.08,6.25,3,Yes,3,9,5,No
9998,CLG0045,107,8.77,8.92,3,No,7,5,1,No
9999,CLG0060,109,9.41,9.77,8,No,3,5,5,No

# Creating Index

```python
df = pd.Dataframe(data, index=collection)
```

number of rows should be equal to number od colums

**WAP to create a dataframe index colums are age and score , index os na,e of the person**

In [116]:
df = pd.DataFrame(
    {
    'course':['DS','DevOps','WebDev'],
    'score':[90, 80 , 60]
    }, index=['Riyan','Amaan','Adnan']
)

df

       course  score
Riyan      DS     90
Amaan  DevOps     80
Adnan  WebDev     60